---
kind: enumMember
id: F:Autodesk.Revit.UI.Selection.PickBoxStyle.Directional
enum: Autodesk.Revit.UI.Selection.PickBoxStyle
source: html/b66a5404-4dba-abc0-f16d-0477e5c8a974.htm
---
# Autodesk.Revit.UI.Selection.PickBoxStyle.Directional

The style of the box depends on the direction in which the box is being drawn. It uses the Crossing style if it is being drawn from right to left, or the Enclosing style when drawn in the opposite direction.